Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/tutorial.tmx
Source language: en
Languages: pt

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
pt: Um método que sobrescreva outro em uma classe derivada pode desejar na verdade estender, ao invés de substituir, o método sobrescrito de mesmo nome na classe base. A maneira mais simples de implementar esse comportamento é chamar diretamente a classe base ``BaseClassName.methodname(self, arguments)``. O que pode ser útil para os usuários da classe também. Note que isso só funciona se a classe base for definida ou importada diretamente no escopo global.

source: Python has two built-in functions that work with inheritance:
pt: O Python tem duas funções internas que trabalham com herança:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
pt: Use :func:`isinstance` para verificar o tipo de uma instância: ``isinstance(obj, int)`` será ``True`` somente se ``obj.__class__`` é :class:`int` ou alguma outra classe derivada da classe :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
pt: Use a função :funf:`issubclass` para verificar a herança: ``issubclass(bool, int)`` é ``True`` pois :class:`bool` é uma subclasse de :class:`int`. No entanto, ``issubclass(float, int)`` é ``False`` porque :class:`float` não é uma subclasse de :class:`int`.

source: Multiple Inheritance
pt: Herança Múltipla

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
pt: Python também suporta uma forma de herança múltipla. Uma definição de classe que herda de várias classes se parece com isso::

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`DerivedClassName`, it is searched for in :class:`Base1`, then (recursively) in the base classes of :class:`Base1`, and if it was not found there, it was searched for in :class:`Base2`, and so on.
pt: Por vários motivos, em um caso simples, você pode pensar na busca por atributos herdados de classes pais como uma busca em profundidade, da esquerda para direita, sem procurar duas vezes na mesma classe. Logo, se um atributo não é encontrado em :class:`DerivedClassName`, ele é procurado em :class:`Base1`, e recursivamente nas classes bases de :class:`Base1`, e apenas se não for encontrado lá a busca prosseguirá em :class:`Base2`, e assim sucessivamente.

source: Private Variables
pt: Variáveis Privadas

source: Odds and Ends
pt: Particularidades

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. An empty class definition will do nicely::
pt: Às vezes, é útil ter um tipo semelhante ao “record” de Pascal ou ao “struct” do C, agrupando itens de dados. Uma definição de classe vazia atende esse propósito:

source: Exceptions Are Classes Too
pt: Exceções Também São Classes

source: User-defined exceptions are identified by classes as well. Using this mechanism it is possible to create extensible hierarchies of exceptions.
pt: Exceções definidas pelo usuário são identificadas por classes. Através deste mecanismo é possível criar hierarquias extensíveis de exceções.

source: There are two new valid (semantic) forms for the :keyword:`raise` statement::
pt: Existem duas novas semânticas válidas para o comando ``raise``::

source: In the first form, ``Class`` must be an instance of :class:`type` or of a class derived from it. The first form is a shorthand for::
pt: Na primeira forma, ``Class`` deve ser uma instância de :class:`type` ou de uma classe derivada dela. A segunda forma é um atalho para::

source: Iterators
pt: Iteradores

source: Generators
pt: Geradores

source: Generator Expressions
pt: Expressões Geradoras

source: More Control Flow Tools
pt: Mais ferramentas para Controle de Fluxo

source: Besides the :keyword:`while` statement just introduced, Python knows the usual control flow statements known from other languages, with some twists.
pt: Além da instrução :keyword:`while` que acabou de ser apresentada, Python possui as estruturas de controle de fluxo comuns de outras linguagens, com algumas variações.

source: :keyword:`if` Statements
pt: Instrução :keyword:`if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
pt: Talvez o tipo de instrução mais conhecido seja a instrução :keyword:`if`. Por exemplo::

source: >>> x = int(input("Please enter an integer: ")) Please enter an integer: 42 >>> if x < 0: ... x = 0 ... print('Negative changed to zero') ... elif x == 0: ... print('Zero') ... elif x == 1: ... print('Single') ... else: ... print('More') ... More
pt: >>> x = int(input("Por favor, entre com um inteiro: ")) Por favor, entre com um inteiro: 42 >>> if x < 0: ... x = 0 ... print('Negativo alterado para zero') ... elif x == 0: ... print('Zero') ... elif x == 1: ... print('Um') ... else: ... print('Mais') ... Mais

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`if` ... :keyword:`elif` ... :keyword:`elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
pt: Podem haver zero ou mais :keyword:`elif`, e a parte :keyword:`else` é opcional. A palavra-chave ':keyword:`elif`' é uma abreviação para 'else if', e é útil para evitar indentação excessiva. Uma sequência :keyword:`if` ... :keyword:`elif` ... :keyword:`elif` ... é um substituto para as instruções ``switch`` ou ``case`` encontrados em outras linguagens.

source: :keyword:`for` Statements
pt: Instrução :keyword:`for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
pt: A instrução :keyword:`for` em Python difere um pouco do que você deve estar acostumado em C ou Pascal. Ao invés de sempre iterar sobre uma progressão aritmética de números (como em Pascal), ou possibilitar o usuário definir tanto o passo da iteração quanto a condição de parada (como C), a instrução :keyword:`for` do Python itera sobre itens de qualquer sequência (uma lista ou uma string), na ordem que eles aparecem na sequência. Por exemplo (sem intenção de fazer trocadilho):

source: It is not safe to modify the sequence being iterated over in the loop (this can only happen for mutable sequence types, such as lists). If you need to modify the list you are iterating over (for example, to duplicate selected items) you must iterate over a copy. The slice notation makes this particularly convenient::
pt: Não é seguro modificar a sequência sendo iterada no loop (só é possível fazer isso com sequências de tipos mutáveis, como listas). Se você precisar modificar a lista que está sendo iterada (para duplicar itens selecionados, por exemplo) você tem que iterar sobre uma cópia. A notação de *slice* torna isso particularmente conveniente::

source: The :func:`range` Function
pt: A funçao :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
pt: Se você precisar iterar sobre uma sequência de números, a função embutida :func:`range` é o que você precisa. Ela gera progressões aritméticas::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
pt: O ponto de parada não faz parte da sequência gerada; ``range(10)`` gera 10 valores, que são os índices válidos para itens de uma sequência de tamanho 10. É possível que o intervalo comece com outro número, ou especificar um incremento diferente (até mesmo negativo; às vezes ele é chamado de 'passo')::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
pt: Para iterar sobre os índices de uma sequência, você pode combinar as funções :func:`range` e :func:`len` da seguinte maneira::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
pt: Na maioria dos casos como este, no entanto, é conveniente usar a função :func:`enumerate`, veja :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
pt: Uma coisa estranha acontece se você tentar mostrar um intervalo::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
pt: O objeto retornado por :func:`range` se comporta como uma lista de várias maneiras, mas de fato, não é. Ele é um objeto no qual retorna itens da sequência desejada de forma sucessiva quando você itera sobre ele, mas isso não faz dele uma lista, economizando, assim, espaço.

source: We say such an object is *iterable*, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such an *iterator*. The function :func:`list` is another; it creates lists from iterables::
pt: Nós dizemos que um objeto é *iterável*, isso é, ele pode ser usado em funções ou construções que esperam alguma coisa na qual elas podem obter itens sucessivamente, até que se esgotem. Temos visto que a instrução :keyword:`for` é como um *iterador*. A função :func:`list` é outra; ela cria listas a partir de iteráveis::

source: Later we will see more functions that return iterables and take iterables as argument.
pt: Mais a frente veremos mais funções que retornam iteráveis e recebem iteráveis como argumento.

source: :keyword:`break` and :keyword:`continue` Statements, and :keyword:`else` Clauses on Loops
pt: Instruções :keyword:`break` e :keyword:`continue`, e Cláusulas :keyword:`else` em Loops

source: The :keyword:`break` statement, like in C, breaks out of the smallest enclosing :keyword:`for` or :keyword:`while` loop.
pt: A instrução :keyword:`break`, como em C, sai de dentro do corpo de um :keyword:`for` ou :keyword:`while` mais próximo.

source: The :keyword:`continue` statement, also borrowed from C, continues with the next iteration of the loop.
pt: A instrução :keyword:`continue`, também pega emprestada do C, continua com a próxima iteração do loop.

source: Loop statements may have an ``else`` clause; it is executed when the loop terminates through exhaustion of the list (with :keyword:`for`) or when the condition becomes false (with :keyword:`while`), but not when the loop is terminated by a :keyword:`break` statement. This is exemplified by the following loop, which searches for prime numbers::
pt: Instruções de loop podem ter um cláusula ``else``; ela é executada quando o loop termina por meio de exaustão da lista (com :keyword:`for`) ou quando a condição se torna falsa (com :keyword:`while`), mas não quando o loop é terminado por um :keyword:`break`. Isto é exemplificado no loop a seguir, que procura por números primos::

source: :keyword:`pass` Statements
pt: Instrução :keyword:`pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
pt: A instrução :keyword:`pass` não faz nada. Ela pode ser usada quando uma instrução é requerida sintaticamente mas o programa precisa fazer nada. Por exemplo::

source: This is commonly used for creating minimal classes::
pt: Isso é comumente usado para criar classes muito pequenas::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`pass` is silently ignored::
pt: Um outro caso onde :keyword:`pass` pode ser usado é como corpo de uma função ou condicional quando você está trabalhando em código novo, permitindo que você continue pensando em um nível a mais de abstração. A instrução :keyword:`pass` é sileciosamente ignorada::

source: Defining Functions
pt: Definindo Funções

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
pt: Nós podemos criar uma função que escreve a série de Fibonacci até um limite arbitrário::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
pt: A palavra-chave :keyword:`def` serve para *definir* uma função. Ela deve ser seguida de um nome de função e uma lista de parâmetros formais entre parênteses. As instruções que compõem o corpo da função começam na linha seguinte, e têm que ser indentadas.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
pt: A primeira instrução do corpo de uma função pode ser opcionalmente uma string literal; a string literal é a string de documentação da função, ou :dfn:`docstring`. (Mais sobre docstrings pode ser encontrado na seção :ref:`tut-docstrings`.) Existem ferramentas que usam docstrings para gerar automaticamente documentação online ou impressa, ou deixam o usuário navegar interativamente pelo código; é uma boa prática incluir docstrings nos códigos que você escreve, então torne isso um hábito.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables cannot be directly assigned a value within a function (unless named in a :keyword:`global` statement), although they may be referenced.
pt: A *execução* de uma função cria uma nova tabela de símbolos, que é usada para guardar variáveis locais na função. Mais precisamente, todas atribuições de variáveis feitas dentro de uma função armazenam o valor em uma tabela de símbolos local; considerando que as referências de variáveis são buscadas primeiramente na tabela local de símbolos, depois na tabela de símbolos das funções mais de fora, depois na tabela global de símbolos, e por último, na tabela interna (*built-in*) de símbolos. Dessa maneira, variáveis globais não podem ser diretamente atribuídas a valores dentro de uma função (a menos que nomeadas numa instrução :keyword:`global`), apesar de poderem ser referenciadas.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, a new local symbol table is created for that call.
pt: Os parâmetros (argumentos) presentes em uma chamada de função são acrescentados na tabela local de símbolos da função que foi chamada quando ela for chamada; assim, argumentos são passados usando *passagem por valor* (onde *valor* é sempre um objeto *referência*, não o valor do objeto). [#]_ Quando uma função chama outra função, uma nova tabela local de símbolos é criada para aquela chamada.

source: A function definition introduces the function name in the current symbol table. The value of the function name has a type that is recognized by the interpreter as a user-defined function. This value can be assigned to another name which can then also be used as a function. This serves as a general renaming mechanism::
pt: Uma definição de função insere o nome da função na tabela de símbolos do contexto. O valor do nome da função tem um tipo que é reconhecido pelo interpretador como função definida por usuário. Esse valor pode ser atribuído a qualquer outro nome que pode então ser usado como uma função. Isso serve como um mechanismo genérico de renomeação::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
pt: Vindo de outras linguagens, você pode dizer que ``fib`` não é uma função, mas um prodecimento, desde que não retorna um valor. Na verdade, até mesmo funções sem uma instrução :keyword:`return` retornam um valor, ainda que um meio chato. Esse valor é chamado ``None`` (é um nome interno). A escrita do valor ``None`` é normalmente supressa pelo interpretador se ele for o único valor escrito. Você pode vê-lo se você realmente quiser, usando :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
pt: É simples escrever uma função que retorna uma lista de números da sequência de Fibonacci, ao invés de mostrá-los::

source: This example, as usual, demonstrates some new Python features:
pt: Esse exemplo, como de costume, mostra algumas funcionalidades novas do Python:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
pt: A instrução :keyword:`return` retorna com um valor de uma função. Se o :keyword:`return` não for seguido de uma expressão, a função retorna ``None``. Chegando até o fim da função também retorna ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
pt: A instrução ``result.append(a)`` chama um *método* do objeto ``result``. Um método é uma função que 'pertence' a um objeto, e é nomeada ``obj.nome_do_metodo``, onde ``obj`` é algum objeto (pode ser uma expressão também), e ``nome_do_metodo`` é o o nome do método que foi definido pelo tipo do objeto. Métodos de diferentes tipos podem ter o mesmo nome sem causar ambiguidade. (É possível definir seus próprios tipos de objetos e métodos, usando *classes*, veja :ref:`tut-classes`) O método :meth:`append` mostrado no exemplo, é definido para objetos do tipo lista; ele adiciona um elemento novo no fim da lista. O exemplo anterior é equivalente a ``result = result + [a]``, porém mais eficiente.

source: An Informal Introduction to Python
pt: Uma Introdução Informal a Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (``>>>`` and ``...``): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
pt: Nos exemplos seguintes, pode-se distinguir a entrada da saída pela presença ou ausência dos prompts (``>>>`` and `` ... ``): para repetir o exemplo, você deve digitar tudo após o prompt, quando o mesmo aparece; linhas que não começarem com o prompt são na verdade as saídas geradas pelo interpretador. Observe que existe um segundo prompt indicando a linha de continuação de um comando com múltiplas linhas, oqual pode ser encerrado pela digitação de um linha em branco.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
pt: Muitos dos exemplos neste manual, até mesmo aqueles digitados no prompt interativo, incluem comentários. Comentários em Python são iniciados pelo caracter ``‘#``’, e se extendem até o final da linha. Um comentário pode aparecer no início da linha, depois de um espaço em branco ou código, mas nunca dentro de uma string (literal). O caracter delimitador de comentários dentro de uma string é interpretado como o próprio caracter. Já que comentários são para explicar o código e não são interpretados pelo Python, eles podem ser omitidos quando escrevendo os exemplos.

source: # this is the first comment SPAM = 1 # and this is the second comment # ... and now a third! STRING = "# This is not a comment."
pt: # esse é o primeiro comentário SPAM = 1 # e esse é o segundo comentário # ... e ainda um terceiro ! STRING = "# Este não é um comentário."

source: Using Python as a Calculator
pt: Utilizando Python como uma Calculadora

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
pt: Vamos tentar alguns comandos simples em Python. Inicie o interpretador e aguarde o prompt primário, ``>>>``. (O que não deve demorar muito.)

source: Numbers
pt: Números
